In [2]:
import pandas as pd
import numpy as np

In [3]:
from numpy.random import rand

In [5]:
np.random.seed(101)

In [8]:
df = pd.DataFrame(rand(5,4),['A','B','C','D','E'],['W','X','Y','Z'])
df

          W         X         Y         Z
A  0.275573  0.672492  0.164303  0.701371
B  0.487635  0.680678  0.521548  0.043397
C  0.223937  0.575205  0.120434  0.500117
D  0.138010  0.052808  0.178277  0.442368
E  0.877587  0.949264  0.478167  0.461119

In [11]:
df['W']

A    0.275573
B    0.487635
C    0.223937
D    0.138010
E    0.877587
Name: W, dtype: float64

In [13]:
type(df['W']),type(df)

(pandas.core.series.Series, pandas.core.frame.DataFrame)

In [15]:
df[['W','Z']]

          W         Z
A  0.275573  0.701371
B  0.487635  0.043397
C  0.223937  0.500117
D  0.138010  0.442368
E  0.877587  0.461119

In [17]:
df['new'] = df['W']+df['Y']

In [19]:
df.new,df

(A    0.439876
 B    1.009183
 C    0.344370
 D    0.316286
 E    1.355755
 Name: new, dtype: float64,
           W         X         Y         Z       new
 A  0.275573  0.672492  0.164303  0.701371  0.439876
 B  0.487635  0.680678  0.521548  0.043397  1.009183
 C  0.223937  0.575205  0.120434  0.500117  0.344370
 D  0.138010  0.052808  0.178277  0.442368  0.316286
 E  0.877587  0.949264  0.478167  0.461119  1.355755)

In [22]:
df.drop('new',axis=1)

          W         X         Y         Z
A  0.275573  0.672492  0.164303  0.701371
B  0.487635  0.680678  0.521548  0.043397
C  0.223937  0.575205  0.120434  0.500117
D  0.138010  0.052808  0.178277  0.442368
E  0.877587  0.949264  0.478167  0.461119

In [23]:
df

          W         X         Y         Z       new
A  0.275573  0.672492  0.164303  0.701371  0.439876
B  0.487635  0.680678  0.521548  0.043397  1.009183
C  0.223937  0.575205  0.120434  0.500117  0.344370
D  0.138010  0.052808  0.178277  0.442368  0.316286
E  0.877587  0.949264  0.478167  0.461119  1.355755

In [24]:
df.drop('new',axis=1,inplace=True) #Completely drops the column in the DB

In [25]:
df

          W         X         Y         Z
A  0.275573  0.672492  0.164303  0.701371
B  0.487635  0.680678  0.521548  0.043397
C  0.223937  0.575205  0.120434  0.500117
D  0.138010  0.052808  0.178277  0.442368
E  0.877587  0.949264  0.478167  0.461119

In [26]:
df.drop('E',axis=0)

          W         X         Y         Z
A  0.275573  0.672492  0.164303  0.701371
B  0.487635  0.680678  0.521548  0.043397
C  0.223937  0.575205  0.120434  0.500117
D  0.138010  0.052808  0.178277  0.442368

In [27]:
df

          W         X         Y         Z
A  0.275573  0.672492  0.164303  0.701371
B  0.487635  0.680678  0.521548  0.043397
C  0.223937  0.575205  0.120434  0.500117
D  0.138010  0.052808  0.178277  0.442368
E  0.877587  0.949264  0.478167  0.461119

In [29]:
df.drop('E',inplace=True)

In [30]:
df

          W         X         Y         Z
A  0.275573  0.672492  0.164303  0.701371
B  0.487635  0.680678  0.521548  0.043397
C  0.223937  0.575205  0.120434  0.500117
D  0.138010  0.052808  0.178277  0.442368

In [32]:
df.shape

(4, 4)

In [34]:
df

          W         X         Y         Z
A  0.275573  0.672492  0.164303  0.701371
B  0.487635  0.680678  0.521548  0.043397
C  0.223937  0.575205  0.120434  0.500117
D  0.138010  0.052808  0.178277  0.442368

In [40]:
df.loc['C'] # works on label based index position

W    0.223937
X    0.575205
Y    0.120434
Z    0.500117
Name: C, dtype: float64

In [38]:
df.iloc[2] # Works on integer based index location

W    0.223937
X    0.575205
Y    0.120434
Z    0.500117
Name: C, dtype: float64

In [42]:
df.loc['B','Y'] # Returns value at this junction

0.5215481923258594

In [44]:
df.loc[['A','B'],['W','Y']] #Gives the subset of the dataFrames

          W         Y
A  0.275573  0.164303
B  0.487635  0.521548